import { TPoolTableRow } from "../shared/types/pool";

export const POOL_DATA_TABLE_ROWS: TPoolTableRow[] = [
  {
    label: "Годовая доходность (APY)",
    value: "apr",
    modalData: {
      title: "Годовая доходность (APY)",
      text: "APY означает годовую процентную доходность. Это способ расчета процентов по инвестициям, учитывающий эффект сложного процента. В традиционных финансах APY используется для таких продуктов, как сберегательные счета и депозитные сертификаты.",
    },
  },
  {
    label: "Общая ликвидность (TVL)",
    value: "tvl",
    modalData: {
      title: "Годовая доходность (APY)",
      text: "APY означает годовую процентную доходность. Это способ расчета процентов по инвестициям, учитывающий эффект сложного процента. В традиционных финансах APY используется для таких продуктов, как сберегательные счета и депозитные сертификаты.",
    },
  },
  {
    label: "Доступный доход",
    value: "rewardsTotal",
    modalData: {
      title: "Годовая доходность (APY)",
      text: "APY означает годовую процентную доходность. Это способ расчета процентов по инвестициям, учитывающий эффект сложного процента. В традиционных финансах APY используется для таких продуктов, как сберегательные счета и депозитные сертификаты.",
    },
    withTON: true,
  },
  {
    label: "Общий доход за 24 часа",
    value: "rewards24",
    modalData: {
      title: "Годовая доходность (APY)",
      text: "APY означает годовую процентную доходность. Это способ расчета процентов по инвестициям, учитывающий эффект сложного процента. В традиционных финансах APY используется для таких продуктов, как сберегательные счета и депозитные сертификаты.",
    },
    withTON: true,
  },
];
